; domain
(define (domain depot)
(:requirements :typing :fluents)
(:types place locatable - object
  depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions
  (load_limit ?t - truck)
  (current_load ?t - truck)
  (weight ?c - crate)
  (fuel-cost)
)

(:action drive
:parameters (?x - truck ?y - place ?z - place)
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
    (increase (fuel-cost) 10)))

(:action lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x))
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action drop
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
    (on ?y ?z)))

(:action load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
    (<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
    (increase (current_load ?z) (weight ?y))))

(:action unload
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
    (decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob5656) (:domain depot)
(:objects
	depot0 - depot
	distributor0 - distributor
	truck0 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear crate1)
	(at pallet2 depot0)
	(clear crate0)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 483)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet2)
	(= (weight crate0) 24)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 66)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 91)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 crate2)
		(on crate2 pallet0)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 2
2. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 66
   goals met: 1 of 2
3. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 2
4. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 66 to 0
   goals met: 1 of 2
5. (drop hoist0 crate1 crate2 depot0)
   deleted: (lifting hoist0 crate1) (clear crate2)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate2)
   goals met: 2 of 2
